/* **********************************************************************
*                                                                       *
* Copyright (c) 1996 Natural MicroSystems Corp.  All rights reserved.   *
* Generated by User Definable Parameter  ( Version 1.0 )                *
* exported udpGenerateParameterSourceFiles() function.                  *
*                                                                       *
* ********************************************************************* */
                                     
                                     
#ifndef ADIMFSPARM_DEFINED           
#define ADIMFSPARM_DEFINED           
                                     
#include "ctadef.h"                  
                                     
#ifdef __cplusplus                   
extern "C"                           
{                                    
#endif                               
                                     
                                     
#define    ADI_MFS_PARMID    0x1001D 
                                     
typedef struct                       
{                                    
    DWORD    size;                   
    WORD    DIDnumber;               /*  0 the expected number of DID         */
    WORD    ANInumber;               /*  1 the expected number of ANI         */
    WORD    RTCdigitnumber;          /*  2 digits the network expects         */
    WORD    optionflags;             /*  3 user preferences                   */
    WORD    debugmask;               /*  4 TCP debug options                  */
    WORD    timerT1;                 /*  5, timer T1                          */
    WORD    timerT2;                 /*  6, timer T2                          */
    WORD    timerT3;                 /*  7, timer T3                          */
    WORD    timerT4;                 /*  8, timer T4                          */
    WORD    timerT5;                 /*  9, timer T5                          */
    WORD    timerT6;                 /* 10, timer T6                          */
    WORD    bitsqualtime;            /* 11, time to qualify bit changes       */
    WORD    releaseguardtime;        /* 12, release guard wink min time       */
    WORD    clearbacktime1;          /* 13, rel.guard recognition time        */
                                     /*     if inbound clears first           */
    WORD    clearbacktime2;          /* 14, rel.guard recognition time        */
                                     /*     if outbound clears first          */
    WORD    answertime;              /* 15, outbound answer timer (s)         */
    WORD    tonesPSTNgroupA;         /* 16, backward PSTN Group A tones       */
    WORD    toneserror;              /* 17, various "error" conditions        */
    WORD    tonesgroupB;             /* 18, backward Group B tones            */
    WORD    tonesCPEgroupA;          /* 19, backward CPE Group A tones        */
    WORD    tonesmiscellaneous;      /* 20, various tones                     */
    WORD    compelledtonelevel;      /* 21, amplitude of cmpl'd tones         */
    WORD    ringfreq;                /* 22, frequency of ring tone            */
    WORD    ringontime;              /* 23, ring-on time                      */
    WORD    ringofftime;             /* 24, ring-off time                     */
    WORD    ringtonelevel;           /* 25, amplitude of ring tone            */
    WORD    busyfreq;                /* 26, frequency of busy tone            */
    WORD    busyontime;              /* 27, busy-on time                      */
    WORD    busyofftime;             /* 28, busy-off time                     */
    WORD    busytonelevel;           /* 29, amplitude of busy                 */
    WORD    congestiontones;         /* 30, tones in a fast busy cycle        */
    WORD    congestionontime;        /* 31, fast busy-on time                 */
    WORD    congestionofftime1;      /* 32, busy-off time                     */
    WORD    congestionofftime2;      /* 33, busy-off time 2                   */
    WORD    alarmsqualtime;          /* 34 qual time for alarms on: 400 ms    */
                                     /*    qual time for alarms off: 500 ms   */
}    ADI_MFS_PARMS;                  
                                     
extern const CTAPARM_DESC * const _adiParmDescTable[];
                                     
                                     
#ifdef __cplusplus                   
}                                    
#endif                               
                                     
#endif                               

